## Terraform Plan Result
```
module.cdn.aws_acm_certificate.cf: Refreshing state... [id=arn:aws:acm:us-east-1:695394391597:certificate/284405db-6c7f-4f27-b341-e14155a202e2]
module.vpc.aws_vpc.vpc: Refreshing state... [id=vpc-04b5cc727428c52f7]
module.networking.aws_acm_certificate.acm: Refreshing state... [id=arn:aws:acm:ap-northeast-1:695394391597:certificate/58bddcc9-7a2f-4c7d-8990-55a7f0991de2]
module.networking.aws_route53_zone.main: Refreshing state... [id=Z0632518T07Q6W1XR2EO]
module.vpc.aws_eip.nat_eip: Refreshing state... [id=eipalloc-0543343fa2d685c07]
module.cdn.aws_s3_bucket.cdn: Refreshing state... [id=testapp-dev-cdn-images]
module.cdn.aws_route53_record.cf_validation["cdn.manno-cloud.com"]: Refreshing state... [id=Z0632518T07Q6W1XR2EO__18c801d97200c67cd00b5640210f275f.cdn.manno-cloud.com._CNAME]
module.cdn.aws_acm_certificate_validation.cf: Refreshing state... [id=2025-11-21 04:45:49.237 +0000 UTC]
module.vpc.aws_internet_gateway.igw: Refreshing state... [id=igw-0e3c7798977f66f51]
module.vpc.aws_subnet.public["public1"]: Refreshing state... [id=subnet-00eaf56d158c83663]
module.vpc.aws_subnet.public["public2"]: Refreshing state... [id=subnet-0b440971a3d6cda1c]
module.vpc.aws_subnet.private["private1"]: Refreshing state... [id=subnet-06dc045b7a9f52f5d]
module.security_group.aws_security_group.security_group["vpc_endpoint_sg"]: Refreshing state... [id=sg-0dc6f50dd3ece6ae1]
module.security_group.aws_security_group.security_group["rds_sg"]: Refreshing state... [id=sg-0b7d3905fcb276807]
module.security_group.aws_security_group.security_group["ec2_sg"]: Refreshing state... [id=sg-0d42386f464d480ba]
module.vpc.aws_subnet.private["private2"]: Refreshing state... [id=subnet-0cd047cc68eec119c]
module.security_group.aws_security_group.security_group["alb_sg"]: Refreshing state... [id=sg-0f8b13163dafc8349]
module.alb.aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:695394391597:targetgroup/testapp-tg/4697acf4d1f77fb7]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-07318a0baf530cb34]
module.rds.aws_db_subnet_group.db_subnet_group: Refreshing state... [id=testapp-dev-db-subnet-group]
module.vpc.aws_nat_gateway.nat: Refreshing state... [id=nat-08a6aea66e2b6634a]
module.vpc.aws_route_table_association.public["public2"]: Refreshing state... [id=rtbassoc-0cd9ca285a885c21d]
module.vpc.aws_route_table_association.public["public1"]: Refreshing state... [id=rtbassoc-030f408fa37efbf4c]
aws_security_group_rule.vpc_endpoint_egress: Refreshing state... [id=sgrule-2352742205]
aws_security_group_rule.allow_ec2_to_rds: Refreshing state... [id=sgrule-1375819127]
aws_security_group_rule.vpc_endpoint_ingress: Refreshing state... [id=sgrule-1325270444]
module.vpc_endpoint.aws_vpc_endpoint.interface["ecr.api"]: Refreshing state... [id=vpce-0cb60e1aedd4c2c4d]
module.vpc_endpoint.aws_vpc_endpoint.interface["logs"]: Refreshing state... [id=vpce-0c87489ed114a9aa2]
module.vpc_endpoint.aws_vpc_endpoint.interface["ssm"]: Refreshing state... [id=vpce-0645d13566ffe789c]
module.vpc_endpoint.aws_vpc_endpoint.interface["ssmmessages"]: Refreshing state... [id=vpce-06b668f691a3c4390]
module.vpc_endpoint.aws_vpc_endpoint.interface["sts"]: Refreshing state... [id=vpce-0f49501550fbf990d]
module.vpc_endpoint.aws_vpc_endpoint.interface["events"]: Refreshing state... [id=vpce-06f17e4d35d3ec79a]
module.vpc_endpoint.aws_vpc_endpoint.interface["monitoring"]: Refreshing state... [id=vpce-08309b3315da0c6b4]
module.vpc_endpoint.aws_vpc_endpoint.interface["ec2messages"]: Refreshing state... [id=vpce-0b8f6adc13e4e9189]
module.vpc_endpoint.aws_vpc_endpoint.interface["ecr.dkr"]: Refreshing state... [id=vpce-0ea5f89601f3a5cb9]
aws_security_group_rule.alb_ingress_http: Refreshing state... [id=sgrule-1346004120]
aws_security_group_rule.alb_ingress_https: Refreshing state... [id=sgrule-1432655771]
aws_security_group_rule.alb_to_ec2: Refreshing state... [id=sgrule-4168814441]
aws_security_group_rule.ec2_egress: Refreshing state... [id=sgrule-2698821133]
module.asg.aws_launch_template.lt: Refreshing state... [id=lt-085a8074e5af194ed]
aws_security_group_rule.allow_alb_to_ec2: Refreshing state... [id=sgrule-2014625289]
module.alb.aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:695394391597:loadbalancer/app/testapp-alb/e1f5b10bd9b5dc4f]
module.cdn.aws_s3_bucket_public_access_block.cdn: Refreshing state... [id=testapp-dev-cdn-images]
module.vpc.aws_route_table.private: Refreshing state... [id=rtb-06d779d53f2625aa0]
module.rds.aws_db_instance.dbinstance: Refreshing state... [id=db-3V3KKH274L3U4SFZS4KYJWD2VI]
module.asg.aws_autoscaling_group.asg: Refreshing state... [id=testapp-dev-asg]
module.vpc.aws_route_table_association.private["private2"]: Refreshing state... [id=rtbassoc-0a2b3628a1732ec71]
module.vpc.aws_route_table_association.private["private1"]: Refreshing state... [id=rtbassoc-0381a569c8eaa5f9b]
module.vpc_endpoint.aws_vpc_endpoint.gateway["dynamodb"]: Refreshing state... [id=vpce-0aad40db2438f5222]
module.vpc_endpoint.aws_vpc_endpoint.gateway["s3"]: Refreshing state... [id=vpce-055086d6755553535]
module.alb.aws_lb_listener.http_redirect: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:695394391597:listener/app/testapp-alb/e1f5b10bd9b5dc4f/b6acabb095da9463]
module.alb.aws_lb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:695394391597:listener/app/testapp-alb/e1f5b10bd9b5dc4f/ffb5ab49a405dc11]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.cdn.aws_acm_certificate_validation.cf must be replaced
-/+ resource "aws_acm_certificate_validation" "cf" {
      ~ id                      = "2025-11-21 04:45:49.237 +0000 UTC" -> (known after apply)
      ~ validation_record_fqdns = [
          - "_18c801d97200c67cd00b5640210f275f.cdn.manno-cloud.com",
        ] -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.cdn.aws_cloudfront_distribution.cdn will be created
  + resource "aws_cloudfront_distribution" "cdn" {
      + aliases                         = [
          + "cdn.manno-cloud.com",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + comment                         = "testapp-dev-cdn"
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = true
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_200"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags                            = {
          + "Env"     = "dev"
          + "Name"    = "testapp-dev-cdn-distribution"
          + "Project" = "testapp"
        }
      + tags_all                        = {
          + "Env"     = "dev"
          + "Name"    = "testapp-dev-cdn-distribution"
          + "Project" = "testapp"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = true
          + default_ttl            = (known after apply)
          + max_ttl                = (known after apply)
          + min_ttl                = 0
          + target_origin_id       = "s3-cdn-origin"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }

          + grpc_config (known after apply)
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = "testapp-dev-cdn-images.s3.ap-northeast-1.amazonaws.com"
          + origin_access_control_id = (known after apply)
          + origin_id                = "s3-cdn-origin"
            # (1 unchanged attribute hidden)
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:695394391597:certificate/284405db-6c7f-4f27-b341-e14155a202e2"
          + minimum_protocol_version = "TLSv1.2_2021"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.cdn.aws_cloudfront_origin_access_control.oac will be created
  + resource "aws_cloudfront_origin_access_control" "oac" {
      + arn                               = (known after apply)
      + description                       = "Managed by Terraform"
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + name                              = "testapp-dev-cdn-oac"
      + origin_access_control_origin_type = "s3"
      + signing_behavior                  = "always"
      + signing_protocol                  = "sigv4"
    }

  # module.cdn.aws_route53_record.cdn_alias will be created
  + resource "aws_route53_record" "cdn_alias" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "cdn.manno-cloud.com"
      + type            = "A"
      + zone_id         = "Z0632518T07Q6W1XR2EO"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.cdn.aws_route53_record.cf_validation["cdn.manno-cloud.com"] will be created
  + resource "aws_route53_record" "cf_validation" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_18c801d97200c67cd00b5640210f275f.cdn.manno-cloud.com"
      + records         = [
          + "_0fdf3ca8ecd73ca9573d6883ce26130e.jkddzztszm.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "Z0632518T07Q6W1XR2EO"
    }

Plan: 5 to add, 0 to change, 1 to destroy.

Warning: Reference to undefined provider

  on main.tf line 268, in module "cdn":
 268:     aws.us_east_1 = aws.us_east_1

There is no explicit declaration for local provider name "aws.us_east_1" in
module.cdn, so Terraform is assuming you mean to pass a configuration for
"hashicorp/aws".

If you also control the child module, add a required_providers entry named
"aws.us_east_1" with the source address "hashicorp/aws".

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
<!-- Sticky Pull Request Commentterraform-plan -->